In [19]:
import pandas as pd
import numpy as np

In [1]:
##Slicing in Python

In [2]:
x='Priyank is a Python Developer'
x[0]

'P'

In [3]:
x[-2]

'e'

In [4]:
x[2:5]

'iya'

In [5]:
x[:10]

'Priyank is'

In [6]:
x[10:]

' a Python Developer'

In [7]:
x[:-10]

'Priyank is a Python'

In [8]:
x[-10:]

' Developer'

In [9]:
x[-2:-5]

''

In [10]:
x={'Christopher Brooks':'brooks@mubich.edu','Bill grace':'billg@microsoft.com'}
x

{'Christopher Brooks': 'brooks@mubich.edu',
 'Bill grace': 'billg@microsoft.com'}

In [11]:
x['Christopher Brooks']

'brooks@mubich.edu'

In [12]:
x.keys()

dict_keys(['Christopher Brooks', 'Bill grace'])

In [13]:
x.values()

dict_values(['brooks@mubich.edu', 'billg@microsoft.com'])

In [26]:
#Date and Time n Python

In [27]:
import datetime as dt
import time as tm

In [28]:
tm.time() #current time in seconds since epoch January 1st,1970

1589387146.3594577

In [29]:
dtnow=dt.datetime.fromtimestamp(tm.time())
dtnow

datetime.datetime(2020, 5, 13, 21, 57, 13, 200393)

In [31]:
today=dt.date.today()
today

datetime.date(2020, 5, 13)

In [33]:
##Creating arrays

In [34]:
my_list=[1,2,3,4,5]
x=np.array(my_list)
x

array([1, 2, 3, 4, 5])

In [35]:
y=np.array([[7,8,9], [10,11,12]])
y

array([[ 7,  8,  9],
       [10, 11, 12]])

In [38]:
y.shape

(2, 3)

In [44]:
n=np.arange(0,30,2) #start from 0 end at 30 differ by 2
n

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28])

In [45]:
n=n.reshape(3,5)
n

array([[ 0,  2,  4,  6,  8],
       [10, 12, 14, 16, 18],
       [20, 22, 24, 26, 28]])

In [55]:
#The Series Data Structure

In [57]:
animals=['Tiger', 'Lion', "Bear"]
pd.Series(animals)

0    Tiger
1     Lion
2     Bear
dtype: object

In [59]:
numbers=[1,2,3,4,5,6]
pd.Series(numbers)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [60]:
animals=['Tiger','Lion','None']
pd.Series(animals)

0    Tiger
1     Lion
2     None
dtype: object

In [61]:
numbers=[1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [63]:
sports={'Archery':'bhutan',
        'Golf':'Scotland',
        'Sumo':'Japan',
        'Taekwondo':'South Korea'}

s=pd.Series(sports)
s

Archery           bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [64]:
#Querying a Series

In [65]:
s.iloc[3]

'South Korea'

In [66]:
s.loc['Golf']

'Scotland'

In [67]:
s[3]

'South Korea'

In [68]:
s['Golf']

'Scotland'

In [70]:
sports={99:'Bhutan',
        100:'Scotland',
        101:'Japan',
        102:'South Korea'}

s=pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [71]:
s.iloc[0]

'Bhutan'

In [73]:
s=pd.Series([100,120,101,3])
s

0    100
1    120
2    101
3      3
dtype: int64

In [74]:
s.sum()

324

In [75]:
len(s)

4

In [77]:
s=s+2
s

0    104
1    124
2    105
3      7
dtype: int64

In [ ]:
# The DataFrame Data Structure

In [83]:
purchase_1 = pd.Series({'Name':'Chris',
                        'Item Purchased':'Dog Food',
                        'Cost':22.50})
purchase_2 = pd.Series({'Name':'Kevyn',
                        'Item Purchased':'Kitty Litter',
                        'Cost':2.50})
purchase_3 = pd.Series({'Name':'Priyank',
                        'Item Purchased':'Bird Seed',
                        'Cost':5.50})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['Store 1','Store 1','Store 2'])
df

            Name Item Purchased  Cost
Store 1    Chris       Dog Food  22.5
Store 1    Kevyn   Kitty Litter   2.5
Store 2  Priyank      Bird Seed   5.5

In [84]:
df.loc['Store 2']

Name                Priyank
Item Purchased    Bird Seed
Cost                    5.5
Name: Store 2, dtype: object

In [85]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [86]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [87]:
df.loc['Store 1','Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [88]:
df.T #gives transpose

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn    Priyank
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5        5.5

In [89]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.5
Name: Cost, dtype: object

In [90]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.5
Name: Cost, dtype: float64

In [93]:
df.drop('Store 1')

            Name Item Purchased  Cost
Store 2  Priyank      Bird Seed   5.5

In [94]:
df

            Name Item Purchased  Cost
Store 1    Chris       Dog Food  22.5
Store 1    Kevyn   Kitty Litter   2.5
Store 2  Priyank      Bird Seed   5.5

In [1]:
#Merging Dataframes

In [3]:
import pandas as pd
df=pd.DataFrame([{'Name':'Chris','Item Purchased':'Sponge','Cost':22.50},
                 {'Name':'Kevin','Item Purchased':'Kitty Litter', 'Cost':2.50},
                 {'Name':'Filip','Item Purchased':'Spoon','Cost':5.00}],
               index=['Store 1','Store 1','Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris         Sponge  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Filip          Spoon   5.0

In [4]:
df['Date']=['December 1','January 1','mid-May']
df

          Name Item Purchased  Cost        Date
Store 1  Chris         Sponge  22.5  December 1
Store 1  Kevin   Kitty Litter   2.5   January 1
Store 2  Filip          Spoon   5.0     mid-May

In [5]:
df['Delivered']=True
df

          Name Item Purchased  Cost        Date  Delivered
Store 1  Chris         Sponge  22.5  December 1       True
Store 1  Kevin   Kitty Litter   2.5   January 1       True
Store 2  Filip          Spoon   5.0     mid-May       True

In [6]:
df['Feedback']=['Positive',None,'Negative']
df

          Name Item Purchased  Cost        Date  Delivered  Feedback
Store 1  Chris         Sponge  22.5  December 1       True  Positive
Store 1  Kevin   Kitty Litter   2.5   January 1       True      None
Store 2  Filip          Spoon   5.0     mid-May       True  Negative

In [7]:
adf=df.reset_index()
adf['Date']=pd.Series({0:'December 1',2:'mid-May'})
adf

     index   Name Item Purchased  Cost        Date  Delivered  Feedback
0  Store 1  Chris         Sponge  22.5  December 1       True  Positive
1  Store 1  Kevin   Kitty Litter   2.5         NaN       True      None
2  Store 2  Filip          Spoon   5.0     mid-May       True  Negative

In [15]:
staff_df=pd.DataFrame([{'Name':'Kelly','Role':'Director of HR'},
                       {'Name':'Sally','Role':'Course liason'},
                       {'Name':'James','Role':'Grader'}])

staff_df=staff_df.set_index('Name')

student_df=pd.DataFrame([{'Name':'James','School':'Business'},
                         {'Name':'Mike','School':'Law'},
                         {'Name':'Sally','School':'Engineering'}])
student_df=student_df.set_index('Name')

print(staff_df)
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally   Course liason
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [16]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally   Course liason  Engineering

In [17]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                Role       School
Name
Sally  Course liason  Engineering
James         Grader     Business

In [18]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally   Course liason  Engineering
James          Grader     Business

In [19]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

                Role       School
Name
James         Grader     Business
Mike             NaN          Law
Sally  Course liason  Engineering

In [20]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally   Course liason  Engineering
2  James          Grader     Business

In [11]:
#Scales

In [17]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                  index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'])
df.rename(columns={0: 'Grades'}, inplace=True)
df

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [19]:
df['Grades'].astype('category').head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): [A, A+, A-, B, ..., C+, C-, D, D+]

In [27]:
#Date Time Functionality

In [29]:
#Timestamp

In [28]:
pd.Timestamp('9/1/2016 10:01AM')

Timestamp('2016-09-01 10:01:00')

In [30]:
#Period

In [31]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [32]:
pd.Period('3/5/2016')

Period('2016-03-05', 'D')

In [33]:
#Date time Index

In [3]:
import pandas as pd
t1=pd.Series(list('abc'),[pd.Timestamp('2016-09-01'),pd.Timestamp('2016-09-02'),pd.Timestamp('2016-09-03')])
t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [4]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [5]:
#Period Index

In [7]:
t2=pd.Series(list('def'),[pd.Period('2016-09'), pd.Period('2016-10'), pd.Period('2016-11')])
t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

In [8]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

In [10]:
import numpy as np
d1=['2 June 2013','Aug 29, 2014','2015-06-26','7/12/15']
ts3=pd.DataFrame(np.random.randint(10,100,(4,2)), index=d1, columns=list('ab'))
ts3

               a   b
2 June 2013   75  79
Aug 29, 2014  37  22
2015-06-26    57  16
7/12/15       30  78

In [11]:
ts3.index=pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  75  79
2014-08-29  37  22
2015-06-26  57  16
2015-07-12  30  78

In [12]:
pd.to_datetime('4.7.12', dayfirst=True)

Timestamp('2012-07-04 00:00:00')

In [13]:
#Timedeltas

In [14]:
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [15]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

In [14]:
##Csv files

In [23]:
celeb=pd.read_csv('C:\\Users\\admin\\Desktop\\datasets\\celeb_info_csv.csv')
celeb

,Unnamed: 0,Name,Category,Image,Well_Known_Movie,Bio
0,0,Freida Pinto,Actress,https://m.media-amazon.com/images/M/MV5BMTg5ND...,Slumdog Millionaire,Freida Selena Pinto was born in Bombay (now Mu...
1,1,Julie Christie,Actress,https://m.media-amazon.com/images/M/MV5BMTY4Mz...,Doctor Zhivago,"Julie Christie, the British movie legend whom ..."
2,2,Priyanka Chopra,Actress,https://m.media-amazon.com/images/M/MV5BMjAxNz...,Baywatch,Priyanka Chopra Jonas (née Chopra) was born on...
3,3,M. Night Shyamalan,Producer,https://m.media-amazon.com/images/M/MV5BMTczMT...,Lady in the Water,"Born in Puducherry, India, and raised in the p..."
4,4,Karen David,Actress,https://m.media-amazon.com/images/M/MV5BMDZkYj...,Galavant,"From India to Canada, England to America, Kare..."
...,...,...,...,...,...,...
4552,4552,Kirti Premraj Jain,Producer,https://m.media-amazon.com/images/G/01/imdb/im...,Romance Complicated,NaN
4553,4553,Jyotirindranath Tagore,Music Department,https://m.media-amazon.com/images/G/01/imdb/im...,Charulata,NaN
4554,4554,Dwijendralal Roy,Writer,https://m.media-amazon.com/images/G/01/imdb/im...,Mathru Bhoomi,Father of Late Dilip Kumar Roy
4555,4555,Raveendranath,Director,https://m.media-amazon.com/images/G/01/imdb/im...,Veerappan,NaN
4556,4556,Inderjit Hassanpuri,Writer,https://m.media-amazon.com/images/G/01/imdb/im...,Man Jeete Jag Jeet,NaN

In [24]:
len(celeb)

4557

In [25]:
celeb.keys()

Index(['Unnamed: 0', 'Name', 'Category', 'Image', 'Well_Known_Movie', 'Bio'], dtype='object')

In [95]:
celeb.head()

,Unnamed: 0,Name,Category,Image,Well_Known_Movie,Bio
0,0,Freida Pinto,Actress,https://m.media-amazon.com/images/M/MV5BMTg5ND...,Slumdog Millionaire,Freida Selena Pinto was born in Bombay (now Mu...
1,1,Julie Christie,Actress,https://m.media-amazon.com/images/M/MV5BMTY4Mz...,Doctor Zhivago,"Julie Christie, the British movie legend whom ..."
2,2,Priyanka Chopra,Actress,https://m.media-amazon.com/images/M/MV5BMjAxNz...,Baywatch,Priyanka Chopra Jonas (née Chopra) was born on...
3,3,M. Night Shyamalan,Producer,https://m.media-amazon.com/images/M/MV5BMTczMT...,Lady in the Water,"Born in Puducherry, India, and raised in the p..."
4,4,Karen David,Actress,https://m.media-amazon.com/images/M/MV5BMDZkYj...,Galavant,"From India to Canada, England to America, Kare..."

In [98]:
#Indexing DataFrames

In [100]:
celeb['Name']=celeb.index
celeb=celeb.set_index('Name')
celeb.head()

,Unnamed: 0,Category,Image,Well_Known_Movie,Bio
Name,,,,,
0,0,Actress,https://m.media-amazon.com/images/M/MV5BMTg5ND...,Slumdog Millionaire,Freida Selena Pinto was born in Bombay (now Mu...
1,1,Actress,https://m.media-amazon.com/images/M/MV5BMTY4Mz...,Doctor Zhivago,"Julie Christie, the British movie legend whom ..."
2,2,Actress,https://m.media-amazon.com/images/M/MV5BMjAxNz...,Baywatch,Priyanka Chopra Jonas (née Chopra) was born on...
3,3,Producer,https://m.media-amazon.com/images/M/MV5BMTczMT...,Lady in the Water,"Born in Puducherry, India, and raised in the p..."
4,4,Actress,https://m.media-amazon.com/images/M/MV5BMDZkYj...,Galavant,"From India to Canada, England to America, Kare..."

In [101]:
celeb=celeb.reset_index()
celeb.head()

,Name,Unnamed: 0,Category,Image,Well_Known_Movie,Bio
0,0,0,Actress,https://m.media-amazon.com/images/M/MV5BMTg5ND...,Slumdog Millionaire,Freida Selena Pinto was born in Bombay (now Mu...
1,1,1,Actress,https://m.media-amazon.com/images/M/MV5BMTY4Mz...,Doctor Zhivago,"Julie Christie, the British movie legend whom ..."
2,2,2,Actress,https://m.media-amazon.com/images/M/MV5BMjAxNz...,Baywatch,Priyanka Chopra Jonas (née Chopra) was born on...
3,3,3,Producer,https://m.media-amazon.com/images/M/MV5BMTczMT...,Lady in the Water,"Born in Puducherry, India, and raised in the p..."
4,4,4,Actress,https://m.media-amazon.com/images/M/MV5BMDZkYj...,Galavant,"From India to Canada, England to America, Kare..."

In [102]:
celeb=celeb.set_index(['Name','Category'])
celeb.head()

,,Unnamed: 0,Image,Well_Known_Movie,Bio
Name,Category,,,,
0,Actress,0,https://m.media-amazon.com/images/M/MV5BMTg5ND...,Slumdog Millionaire,Freida Selena Pinto was born in Bombay (now Mu...
1,Actress,1,https://m.media-amazon.com/images/M/MV5BMTY4Mz...,Doctor Zhivago,"Julie Christie, the British movie legend whom ..."
2,Actress,2,https://m.media-amazon.com/images/M/MV5BMjAxNz...,Baywatch,Priyanka Chopra Jonas (née Chopra) was born on...
3,Producer,3,https://m.media-amazon.com/images/M/MV5BMTczMT...,Lady in the Water,"Born in Puducherry, India, and raised in the p..."
4,Actress,4,https://m.media-amazon.com/images/M/MV5BMDZkYj...,Galavant,"From India to Canada, England to America, Kare..."

In [2]:
import pandas as pd
espy=pd.read_csv('C:\\Users\\admin\\Desktop\\datasets\\ESPYBestTeam.csv')
espy

,State,New England Patriots,Connecticut Huskies,Golden State Warriors,Chicago Blackhawks,Ohio State Buckeyes
0,Rhode Island (United States),100.00,0.00,4.50,2.72,2.27
1,Massachusetts (United States),92.64,0.19,5.60,3.17,2.43
2,New Hampshire (United States),90.80,0.00,3.00,2.64,2.14
3,Maine (United States),83.77,0.00,3.96,2.23,2.38
4,Vermont (United States),46.97,0.00,4.08,2.93,3.14
5,Connecticut (United States),31.55,1.64,4.24,2.92,2.73
6,District of Columbia (United States),25.00,0.00,7.79,4.03,6.40
7,Colorado (United States),14.74,0.00,4.35,5.63,4.70
8,Delaware (United States),14.34,0.00,4.69,2.55,3.75
9,Wyoming (United States),13.71,0.00,5.45,3.61,4.64
10,Hawaii (United States),13.64,0.00,9.77,2.88,3.84
11,Montana (United States),13.46,0.00,5.67,4.14,2.98
12,Washington (United States),13.26,0.00,18.98,2.38,2.97
13,South Dakota (United States),12.99,0.00,5.90,5.01,3.98
14,New Mexico (United States),12.85,0.00,5.95,2.40,2.89
15,Maryland (United States),12.67,0.00,4.85,1.78,4.57
16,Alaska (United States),12.42,0.00,5.18,4.23,3.19
17,Florida (United States),12.31,0.06,5.65,3.51,5.64
18,Nevada (United States),12.16,0.00,11.41,3.51,3.49
19,West Virginia (United States),12.04,0.00,5.06,1.55,13.02
20,Oklahoma (United States),11.99,0.00,7.41,3.84,12.07
21,South Carolina (United States),11.95,0.00,6.02,2.22,6.99
22,New York (United States),11.78,0.08,5.82,2.80,3.28
23,North Carolina (United States),11.78,0.00,5.73,2.01,5.02
24,North Dakota (United States),11.78,0.00,4.58,7.93,3.46
25,Arizona (United States),11.71,0.00,6.68,4.64,4.38
26,Pennsylvania (United States),11.68,0.09,5.67,4.77,7.90
27,New Jersey (United States),11.41,0.09,5.08,2.40,3.22
28,Kentucky (United States),11.23,0.00,7.05,5.44,8.43
29,Mississippi (United States),11.10,0.00,5.47,1.41,5.36
30,Indiana (United States),10.55,0.00,4.71,19.49,9.48
31,Nebraska (United States),10.22,0.00,5.03,6.50,6.55
32,Wisconsin (United States),10.20,0.00,4.26,14.51,5.17
33,Georgia (United States),10.16,0.00,6.75,3.91,5.83
34,Iowa (United States),10.03,0.00,5.49,11.92,5.10
35,California (United States),9.95,0.03,25.35,6.45,2.45
36,Idaho (United States),9.93,0.00,5.07,1.79,3.34
37,Tennessee (United States),9.78,0.00,6.48,3.45,6.12
38,Utah (United States),9.43,0.00,5.90,2.26,3.31
39,Texas (United States),9.41,0.05,7.01,2.31,3.67
40,Louisiana (United States),9.27,0.00,6.15,1.64,5.99
41,Illinois (United States),8.87,0.00,7.02,73.72,6.16
42,Arkansas (United States),8.44,0.00,5.20,1.99,4.11
43,Ohio (United States),8.44,0.00,9.87,3.17,82.31
44,Michigan (United States),8.41,0.00,5.30,5.34,15.93
45,Kansas (United States),8.39,0.00,3.98,2.98,3.69
46,Missouri (United States),8.33,0.00,4.43,5.92,4.45
47,Minnesota (United States),8.08,0.00,4.44,9.29,4.93
48,Virginia (United States),7.60,0.04,2.93,1.22,2.94
49,Alabama (United States),6.85,0.00,5.15,1.83,7.95
50,Oregon (United States),4.23,0.00,4.49,1.12,3.02

In [13]:
espy.rename(columns={'Unnamed: 1':'New England Patriots',
                     'Unnamed: 2':'Connecticut Huskies',
                     'Unnamed: 3':'Golden State Warriors',
                     'Unnamed: 4':'Chicago Blackhawks',
                     'Unnamed: 5':'Ohio State Buckeyes'},
            inplace=True)
espy.head()

,State,New England Patriots,Connecticut Huskies,Golden State Warriors,Chicago Blackhawks,Ohio State Buckeyes
0,Rhode Island (United States),100.00,0.00,4.50,2.72,2.27
1,Massachusetts (United States),92.64,0.19,5.60,3.17,2.43
2,New Hampshire (United States),90.80,0.00,3.00,2.64,2.14
3,Maine (United States),83.77,0.00,3.96,2.23,2.38
4,Vermont (United States),46.97,0.00,4.08,2.93,3.14

In [3]:
espy=espy[espy['Golden State Warriors']<5]
espy.set_index(['State'],inplace=True)
espy.head()

,New England Patriots,Connecticut Huskies,Golden State Warriors,Chicago Blackhawks,Ohio State Buckeyes
State,,,,,
Rhode Island (United States),100.00,0.00,4.50,2.72,2.27
New Hampshire (United States),90.80,0.00,3.00,2.64,2.14
Maine (United States),83.77,0.00,3.96,2.23,2.38
Vermont (United States),46.97,0.00,4.08,2.93,3.14
Connecticut (United States),31.55,1.64,4.24,2.92,2.73

In [4]:
import numpy as np
def min_max(row):
    data=row[['New England Patriots',
              'Connecticut Huskies',
              'Golden State Warriors',
              'Chicago Blackhawks',
              'Ohio State Buckeyes']]
    return pd.Series({'min':np.min(data),'max':np.max(data)})

In [5]:
espy.apply(min_max,axis=1)

                                min     max
State
Rhode Island (United States)   0.00  100.00
New Hampshire (United States)  0.00   90.80
Maine (United States)          0.00   83.77
Vermont (United States)        0.00   46.97
Connecticut (United States)    1.64   31.55
Colorado (United States)       0.00   14.74
Delaware (United States)       0.00   14.34
Maryland (United States)       0.00   12.67
North Dakota (United States)   0.00   11.78
Indiana (United States)        0.00   19.49
Wisconsin (United States)      0.00   14.51
Kansas (United States)         0.00    8.39
Missouri (United States)       0.00    8.33
Minnesota (United States)      0.00    9.29
Virginia (United States)       0.04    7.60
Oregon (United States)         0.00    4.49

In [6]:
for group, frame in espy.groupby('State'):
    avg=np.average(frame['New England Patriots'])
    print('Countries in state' + group + 'have average New England Patriots' + str(avg))

Countries in stateColorado (United States)have average New England Patriots14.74
Countries in stateConnecticut (United States)have average New England Patriots31.55
Countries in stateDelaware (United States)have average New England Patriots14.34
Countries in stateIndiana (United States)have average New England Patriots10.55
Countries in stateKansas (United States)have average New England Patriots8.39
Countries in stateMaine (United States)have average New England Patriots83.77
Countries in stateMaryland (United States)have average New England Patriots12.67
Countries in stateMinnesota (United States)have average New England Patriots8.08
Countries in stateMissouri (United States)have average New England Patriots8.33
Countries in stateNew Hampshire (United States)have average New England Patriots90.8
Countries in stateNorth Dakota (United States)have average New England Patriots11.78
Countries in stateOregon (United States)have average New England Patriots4.23
Countries in stateRhode Island (United States)have average New England Patriots100.0
Countries in stateVermont (United States)have average New England Patriots46.97
Countries in stateVirginia (United States)have average New England Patriots7.6
Countries in stateWisconsin (United States)have average New England Patriots10.2

In [ ]:
espy = espy.set_index('State')

def fun(item):
    if item[0]

In [7]:
espy=espy[espy['Chicago Blackhawks']<5]
espy

,New England Patriots,Connecticut Huskies,Golden State Warriors,Chicago Blackhawks,Ohio State Buckeyes
State,,,,,
Rhode Island (United States),100.00,0.00,4.50,2.72,2.27
New Hampshire (United States),90.80,0.00,3.00,2.64,2.14
Maine (United States),83.77,0.00,3.96,2.23,2.38
Vermont (United States),46.97,0.00,4.08,2.93,3.14
Connecticut (United States),31.55,1.64,4.24,2.92,2.73
Delaware (United States),14.34,0.00,4.69,2.55,3.75
Maryland (United States),12.67,0.00,4.85,1.78,4.57
Kansas (United States),8.39,0.00,3.98,2.98,3.69
Virginia (United States),7.60,0.04,2.93,1.22,2.94
Oregon (United States),4.23,0.00,4.49,1.12,3.02

In [8]:
espy.groupby('State').agg({'Chicago Blackhawks':np.average})

                               Chicago Blackhawks
State
Connecticut (United States)                  2.92
Delaware (United States)                     2.55
Kansas (United States)                       2.98
Maine (United States)                        2.23
Maryland (United States)                     1.78
New Hampshire (United States)                2.64
Oregon (United States)                       1.12
Rhode Island (United States)                 2.72
Vermont (United States)                      2.93
Virginia (United States)                     1.22